{
  "name": "Alchemy",
  "label": "alchemy",
  "type": "Perk",
  "cost": 150,
  "requirements": [],
  "tags": [
    "passive",
    "repeatable",
    "source"
  ],
  "description": {
    "text": [
      "You can combine Alchemical Essences and Objects into alchemical products.",
      "To do so, you have to learn alchemical recipes.",
      "Alchemical recipes are organised by Tiers.",
      "Potions are crafted in batches.",
      "You can create up to 5 potions in one batch, and crafting one batch takes one hour.",
      "The potions in a batch all have to be of the same kind.",
      "Crafting potions requires a mortar and pestle.",
      "Each potion requires one set of ingredients and a solvent.",
      "Also, it is necessary to use a vial to create a potion.",
      "If the solvent is already in a vial, no additional vial is necessary.",
      "Each 1-hour batch is created by rolling the check only once.",
      "The first bonus is applied when the Difficulty Value of that recipe is beaten by 5, and the second bonus is applied when the Difficulty Value is beaten by 10.",
      "If the check is failed by 5 or more, the creation fails and all the ingredients are lost.",
      "Otherwise, the creation fails and 1 hour passes, but the creator keeps the ingredients.",
      "Creating a potion requires some way of heating it.",
      "You can learn alchemical recipes of Tier 1.",
      "Most recipes require a Mortar and Pestle, and can be improved by higher quality items or additional tools as noted on the alchemical recipe.",
      "The check to create a potion is an Intellect check, and you can add your Crafting Level to it.",
      "You can also add your Crafting level on checks about alchemy, including the identification of potions."
    ]
  },
  "progression": {
    "type": "formula",
    "value": "{{costOldRank}} + {{newRank}} * 100",
    "description": {
      "text": [
        "You can learn Tier {{newRank}} alchemical recipes",
        {
          "conditional": "{{newRank}} % 3 == 0",
          "value": "you gain a +{{param1}}d4 Skill Bonus to Alchemy checks",
          "param1": "{{newRank}}/3"
        }
      ]
    },
    "amountWritten": 10
  }
}